
//    array

const dolar = [

    {
        año: 1992,
        i: 0.9916
    },
    {
        año: 1993,
        i: 0.9984
    },
    {
        año: 1994,
        i: 1.0014
    },
    {
        año: 1995,
        i: 1.0016
    },
    {
        año: 1996,
        i: 1.0005
    },
    {
        año: 1997,
        i: 1.0014
    },
    {
        año: 1998,
        i: 1.0010
    },
    {
        año: 1999,
        i: 1.0014
    },
    {
        año: 2000,
        i: 1.0014
    },
    {
        año: 2001,
        i: 1.1499
    },
    {
        año: 2002,
        i: 3.4050
    },
    {
        año: 2003,
        i: 2.9400
    },
    {
        año: 2004,
        i: 2.9750
    },
    {
        año: 2005,
        i: 3.0320
    },
    {
        año: 2006,
        i: 3.0620
    },
    {
        año: 2007,
        i: 3.1490
    },
    {
        año: 2008,
        i: 3.4530
    },
    {
        año: 2009,
        i: 3.8000
    },
    {
        año: 2010,
        i: 3.9760
    },
    {
        año: 2011,
        i: 4.73
    },
    {
        año: 2012,
        i: 6.78
    },
    {
        año: 2013,
        i: 9.95
    },
    {
        año: 2014,
        i: 13.70
    },
    {
        año: 2015,
        i: 14.17
    },
    {
        año: 2016,
        i: 16.47
    },
    {
        año: 2017,
        i: 18.88
    },
    {
        año: 2018,
        i: 38.50
    },
    {
        año: 2019,
        i: 38.50
    },
    {
        año: 2020,
        i: 73.50
    },
    {
        año: 2021,
        i: 176.50
    },
]

localStorage.setItem('datos2', JSON.stringify(dolar));
const guardado2 = localStorage.getItem('datos2')
// console.log('objetoObtenido: ', JSON.parse(guardado2));
